п»їnamespace Matrices.Classes
{
    public class cgMatrix
    {
        /// <summary>РЅРµРЅСѓР»РµРІС‹Рµ СЌР»РµРјРµРЅС‚С‹</summary>
        int[] Elements;
        /// <summary> СЃС‚РѕР»Р±С†РѕРІС‹Рµ РєРѕРѕСЂРґРёРЅР°С‚С‹ </summary>
        int[] JA;

        /// <summary> РёРЅРґРµРєСЃ СЃС‚Р°СЂС‚РѕРІРѕРіРѕ СЌР»РµРјРµРЅС‚Р° СЃС‚СЂРѕРєРё </summary>
        // РЅРѕРјРµСЂ СЌР»РµРјРµРЅС‚Р°, СЃ РєРѕС‚РѕСЂРѕРіРѕ РЅР°С‡РёРЅР°РµС‚СЃСЏ
        // СЃС‚СЂРѕРєР°. РµСЃР»Рё СЃС‚СЂРѕРєР° РїСѓСЃС‚Р°СЏ, С‚Рѕ Р±СѓРґРµС‚ РґСѓР±Р»РёСЂРѕРІР°С‚СЊСЃСЏ 
        //РЅР°РїСЂРёРјРµСЂ, РµСЃР»Рё РїРµСЂРІР°СЏ СЃС‚СЂРѕРєР° РїСѓСЃС‚Р°СЏ, Р° РІС‚РѕСЂР°СЏ, СЃРѕРѕС‚РІРµС‚СЃС‚РІРµРЅРЅРѕ,
        //РЅР°С‡РёРЅР°РµС‚СЃСЏ СЃ РЅСѓР»РµРІРѕРіРѕ (РїРµСЂРІРѕРіРѕ) СЌР»РµРјРµРЅС‚Р°, С‚Рѕ РїРµСЂРІС‹Рµ РґРІР° СЌР»РµРјРµРЅС‚Р° Р±СѓРґСѓС‚ 1,1
        // РљРѕР»-РІРѕ СЌР»-С‚РѕРІ РІ i-РѕР№ СЃС‚СЂРѕРєРµ = JR[i+1]-JR[i]

        int[] JR;

        public cgMatrix(Matrix m)
        {
            JR = new int[m.RowCount + 1];

            List<int> e = new List<int>();
            List<int> a = new List<int>();
            for (int i = 0; i < m.RowCount; i++)
            {
                for (int j = 0; j < m.ColCount; j++)
                {
                    if (m[i, j] != 0)
                    {
                        e.Add(m[i, j]);
                        a.Add(j);
                    }
                }
                JR[i] = e.Count;
            }

            Elements = e.ToArray();
            JA = a.ToArray();
        }
    }
}
